package Task1;
/*Вы работаете в фирме по изготовлению и установке заборов. В вашей компании есть возможность заказать
        заборы на участки круглой, прямоугольной и многоугольной формы. Разработайте программу, в которой можно
        будет посчитать цену забора на участок. Програма должна спрашивать форму участка, размеры участка в метрах
        и цену за метр забора.

        Для выполнения задания создать абстрактный класс Shape, в нем описать абстрактный метод getPerimeter

        Создать классы Прямоугольник, Круг и Правильный многоугольник, которые наследуют этот класс.

        Справка: Правильный многоугольник - такая фигура, у которой неопределенное количество сторон, но все эти
        стороны равны между собой, и сложены таким образом, что все углы в многоугольнике равны.

        В Main написать саму программу, которая при запуске спрашивает все что нужно, создает нужный объект и считает
        периметр участка. Расчёт цены должен также происходить в Main. Введение формы участка реализовать одним из двух
        способов: 1 Считывать название формы как строку 2 Вывести в консоль пронумерованный список доступных форм, и считывать
        номер формы (на подобии меню)
 */