package Birds;

public class Bird {
    /*Создать класс Bird с методом fly(), затем реализуйте подклассы Penguin и Eagle.
    Оба должны наследовать Bird, но только Eagle может летать.
     */
    void fly(){
        System.out.println("Это птица. По идее она должна летать");
    }
}
