package Example1;
/*   /*
    Разработать простую иерархию транспорта
    У транспорта должно быть свойство "количество топлива" и метод, который позволит посчитать расход топлива
    Добавить интерфейсы PeopleTransport и CargoTransport, которые определят соответствующие методы для дополнительных
    расчетов расхода топлива в зависимости от груза или пассажиров

Взять пример 1 из классной работы и создать новый класс который
        будет реализовывать оба интерфейса. Продемонстрировать работу класса в main

 */