package Task2;
/*Задание 2 (продолжение)
        Ваша компания по какой-то причине захотела, чтобы в программе можно было изменить размер участка,
        периметр которого вы считаете, после факта подсчета, и потом пересчитать еще раз.

        Скопировать код из предыдущего задания. Разработать интерфейс Resizable, который опишет метод
         resize(double coefficient). Изменить класс Shape так, чтобы он реализовывал этот интерфейс.
         Реализовать добавленный интерфейсом метод в неабстрактных классах-наследниках класса Shape. Этот метод должен
         пропорционально увеличивать размер фигуры. Например, если этот метод вызвать на прямоугольнике
         со сторонами 4 и 5, передав 2, стороны должны стать 8 и 10

         В основной программе, после расчета цены забора, спросить, хочет ли пользователь пропорционально
         изменить размер участка, и если да, предоставить возможность ввести коэффициент и пересчитать сумму.
 */



